# Pandas 数据结构操作

In [2]:
import numpy as np
import pandas as pd

In [3]:
# 创建Series
s = pd.Series([1, 3, 5, 12, 6, 8])
s

0     1
1     3
2     5
3    12
4     6
5     8
dtype: int64

In [5]:
# 创建包含空值的Series
s = pd.Series([1, 3, np.nan, 12, 6, 8])
s

0     1.0
1     3.0
2     NaN
3    12.0
4     6.0
5     8.0
dtype: float64

In [6]:
# 获取Series中元素值
s = pd.Series(['python', 3, np.nan, 12, 6, 8])
print(s[0])
print(s[4])

python
6

In [7]:
#导入数据集到DataFrame
data=pd.read_csv("./test.csv")
data

   age  gender  salary
0   28    male   50000
1   29  female   35000
2   35    male   67500
3   36    male   65000
4   48    male  100000
5   55  female   95000

In [10]:
# 创建空DataFrame
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [11]:
# 通过列表创建DataFrame
data=pd.DataFrame(
[["xcy-01","2001-02-20",5160],
["xcy-02","2001-03-15",5161],
["xcy-03","2021-11-21",5162]],
columns=['name','birth','number'])
data

     name       birth  number
0  xcy-01  2001-02-20    5160
1  xcy-02  2001-03-15    5161
2  xcy-03  2021-11-21    5162

In [12]:
# 通过字典创建DataFrame
data= pd.DataFrame({
    "name":["xcy-01","xcy-02","xcy-03"],
    "birth":["02-20","03-15","11-21"],
    "number":[5160,5161,5162]
})
data

     name  birth  number
0  xcy-01  02-20    5160
1  xcy-02  03-15    5161
2  xcy-03  11-21    5162

In [14]:
# 判断DataFrame是否为空
print(pd.DataFrame().empty)
print(pd.DataFrame({"No":[1,2]}).empty)

True
False

In [23]:
# 合并DataFrame
df1=pd.DataFrame([
    ['Somu', 68, 84, 78, 96],
    ['Kiku', 74, 56, 88, 85],
    ['Ajit', 77, 73, 82, 87]],
    columns=['name', 'physics', 'chemistry','algebra','calculus'])
df2=pd.DataFrame(
    [['Amol', 72, 67, 91, 83],
    ['Lini', 78, 69, 87, 92]],
    columns=['name', 'physics', 'chemistry','algebra','calculus'])
df3=pd.concat([df1,df2],sort=False)
df3 # 连接后序号不连续
# df4=pd.concat([df1,df2],sort=True)
# df4
df3.reset_index(drop=True, inplace=True)# 重设序号
df3

   name  physics  chemistry  algebra  calculus
0  Somu       68         84       78        96
1  Kiku       74         56       88        85
2  Ajit       77         73       82        87
3  Amol       72         67       91        83
4  Lini       78         69       87        92

In [24]:
# 合并包含列不同的DataFrame
df1=pd.DataFrame([
    ['Somu', 68, 84, 78 ],
    ['Kiku', 74, 56, 88],
    ['Ajit', 77, 73, 82]],
    columns=['name', 'physics', 'chemistry','algebra'])
df2=pd.DataFrame(
    [['Amol', 72,  91, 83],
    ['Lini', 78, 87, 92]],
    columns=['name', 'physics','algebra','calculus'])
df3=pd.concat([df1,df2],sort=False)
df3 # 连接后序号不连续
# df4=pd.concat([df1,df2],sort=True)
# df4
df3.reset_index(drop=True, inplace=True)# 重设序号
df3

   name  physics  chemistry  algebra  calculus
0  Somu       68       84.0       78       NaN
1  Kiku       74       56.0       88       NaN
2  Ajit       77       73.0       82       NaN
3  Amol       72        NaN       91      83.0
4  Lini       78        NaN       87      92.0

In [26]:
# 添加新行
df1=pd.DataFrame([
    ['Somu', 68, 84, 78 ],
    ['Kiku', 74, 56, 88],
    ['Ajit', 77, 73, 82]],
    columns=['name', 'physics', 'chemistry','algebra'])
df2=pd.DataFrame(
    [['Amol', 72,  91, 83],
    ['Lini', 78, 87, 92]],
    columns=['name', 'physics','algebra','calculus'])
df3=df1.append(df2,ignore_index=True,sort=False)
df3

   name  physics  chemistry  algebra  calculus
0  Somu       68       84.0       78       NaN
1  Kiku       74       56.0       88       NaN
2  Ajit       77       73.0       82       NaN
3  Amol       72        NaN       91      83.0
4  Lini       78        NaN       87      92.0

In [31]:
# 查询
df = pd.DataFrame(
    [[21, 72, 67],
    [23, 78, 62],
    [32, 74, 56],
    [73, 88, 67],
    [32, 74, 56],
    [43, 78, 69],
    [32, 74, 54],
    [52, 54, 76]],
    columns=['a', 'b', 'c'])
df1=df.query("a>50")
print("---df1---\n",df1)
df2=df.query("a>40 and b>50")
print("---df2---\n",df2)

---df1---
     a   b   c
3  73  88  67
7  52  54  76
---df2---
     a   b   c
3  73  88  67
5  43  78  69
7  52  54  76